<?php

$page = $_POST['page'];

$typesDryClean = [
	'serv1' => 'Ковролин (1 кв.м.)',
	'serv2' => 'Удаление запаха урины (5 кв.м.)',
	'serv3' => 'Диван (2 м., флок, кожа)',
	'serv4' => 'Диван (2 м., простые ткани)',
	'serv5' => 'Посадочное место (50-60 см)',
	'serv6' => 'Посадочное место (50-60см., флок, кожа,алькантара)',
	'serv7' => 'Спальное место дивана (простые ткани)',
	'serv8' => 'Спальное место дивана (флок, кожа, алькантара)',
	'serv9' => 'Кресло (простые ткани)',
	'serv10' => 'Кресло (флок,кожа,алькантара (искуственная замша))',
	'serv11' => 'Полукресло (простые ткани)',
	'serv12' => 'Полукресло (флок, кожа, алькантара (ис.замша) )',
	'serv13' => 'Каркас кровати',
	'serv14' => 'Стул без тканевой спинки',
	'serv15' => 'Стул с тканевой спинкой',
	'serv16' => 'Офисный стул (простые ткани)',
	'serv17' => 'Офисный стул (флок, кожа, алькантара (иск.замша) )',
	'serv18' => 'Пуфик (простые ткани)',
	'serv19' => 'Пуфик (флок, кожа, алькантара (иск.замша) )',
	'serv20' => 'Кухонный уголок (простые ткани)',
	'serv21' => 'Кухонный уголок (флок, кожа, алькантара (иск.з.) )',
	'serv22' => 'Портьера однослойная (1 кв.м.)',
	'serv23' => 'Портьера двойная на подкладе (1 кв.м.)',
	'serv24' => 'Ламбрекен (1 кв.м.)',
	'serv25' => 'Римские шторы (1 кв.м.)',
	'serv26' => 'Французские шторы (1 кв.м.)',
	'serv27' => 'Подхваты (1 кв.м.)',
	'serv28' => 'Монтаж/демонтаж (1 кв.м.)',
	'serv29' => 'Жалюзи (ткань) (1 кв.м.)',
	'serv30' => 'Жалюзи (металл) (1 кв.м.)',
	'serv31' => 'Матрац (односпальный с одной стороны)',
	'serv32' => 'Матрац (полутораспальный, с одной стороны)',
	'serv33' => 'Матрац (двуспальный, с одной стороны)',
	'serv34' => 'Матрац (односпальный, с двух сторон)',
	'serv35' => 'Матрац (полутораспальный, с двух сторон)',
	'serv36' => 'Матрац (двуспальный, с двух сторон)',
	'serv37' => 'Матрац (детский)',
	'serv38' => 'Матрац (детский, две стороны)',
	'serv39' => 'Матрац (для шезлонгов, две стороны)',
	'serv40' => 'Матрац (евро, две стороны)',
	'serv41' => 'Кресло-кровать (простые ткани)',
	'serv42' => 'Кресло-кровать (флок,кожа,алькантара (иск.замша) )',
	'serv43' => 'Удаление жвачки',
	'serv44' => 'Пятновыведение (1 кв.см.)',
	'serv45' => 'Удаление запаха урины (мебель, шторы, мартац)',
	'serv46' => 'Ковер (синтетика)',
	'serv47' => 'Ковер (шерсть, полушерсть (фабричная работа) )',
	'serv48' => 'Ковер (хлопок)',
	'serv49' => 'Ковер (вискоза, ковры на клеевой основе)',
	'serv50' => 'Ковер (шерсть, ручная работа) (1 кв.м., )',
	'serv51' => 'Подушка (маленькая, диванная)'
];

$typesFlat = [
	'support' => 'Поддерживающая уборка',
	'general' => 'Генеральная уборка'
];

$typesWindow = [
	'solid-one' => 'Цельные, с одной стороны',
	'solid-two' => 'Цельные, с двух сторон',
	'double-two' => 'Двойные, с двух сторон'
];

switch ($page){
	case 'index':
		$type = $typesFlat[$_POST['type']];
		$phone = $_POST['phone'];
		$range = $_POST['range'];
		$message = "Заказ уборки с главной страницы\nТип уборки: ".$type."\nПлощадь квартиры: ".$range." кв. м.\nТелефон: ".$phone;
		break;
	case 'flat':
		$type = $typesFlat[$_POST['type']];
		$phone = $_POST['phone'];
		$range = $_POST['range'];
		$message = "Заказ уборки квартиры\nТип уборки: ".$type."\nПлощадь квартиры: ".$range." кв. м.\nТелефон: ".$phone;
		break;
	case 'window':
		$type = $typesWindow[$_POST['type']];
		$phone = $_POST['phone'];
		$range = $_POST['range'];
		$message = "Заказ мытья окон\nТип окон: ".$type."\nПлощадь квартиры: ".$range." кв. м.\nТелефон: ".$phone;
		break;
	case 'dry-clean':
		$type = $typesDryClean[$_POST['type']];
		$phone = $_POST['phone'];
		$message = "Заказ химчистки\nУслуга: ".$type."\nТелефон: ".$phone;
		break;
}

mail("maximtkachev99@gmail.com", "Заявка с сайта Мой дом", $message, "From: maximtkachev99@gmail.com \r\n"));

?>